{
    "name": "Jessy",
    "surname": "Godais",
    "pictures": "/images/Photo-JessyGodais.png",
    "description": [
        "Bonjour ! Comme vous avez pu le voir, je m'appelle Jessy, je suis développeur web et web mobile junior.",
        "Mon objectif est de finir full Stack Sénior dans le développement web et mobile, y compris dans les applications mobiles. Je souhaite découvrir de nouvelles choses, développer de nombreux projets de toutes sorte.",
        "Je souhaite également apprendre à coder et programmer des jeux, en tant que Gamer, ça parait logique, mais je pense vraiment pouvoir m'éclater la dedans. Voilà tout ce qui me motive !"
    ],
    "year": "34 ans",
    "car": "permis B",
    "job": "Developpeur web et web mobile",
    "adress": "25 rue du bâtiment",
    "postal": "81200",
    "country": "Mazamet, France",
    "tel": "0763205410",
    "mail": "jessegodais@gmail.com",
    "github": "https://github.com/GohanJesse?tab=repositories",
    "linkedin": "https://www.linkedin.com/in/jessy-godais-72004b24a/",
    "background": [
        "Après avoir été dans l'industrie agro-alimentaire, la restauration, le monde des chantiers et l'industrie métalurgique, ma vie a été marquée par une longue période d'inactivité professionnelle en lien avec ma volonté de prendre le temps pour mes enfants. Cette période, ma également permis de prendre du recule sur ces différents métiers et donc divers domaines et secteurs d'activité.",
        "j'ai pu faire une introspéction et une remise en question de ma vie professionnel. J'ai également pu avoir du temps pour mettre mes talents d'autodidacte, ma volonté d'évolution et ma soif de connaissance générale en action.",
        "De ce développement personnel en est sorti une chose, je veux travailler dans quelque chose que j'aime !",
        "Étant geek et gamer, le numérique et la tech est un milieu que je considère comme un hobbi. On va pas rentrer dans le cliché du mec passionné, mais c'est clairement un domaine dans lequel je m'éclate ! Je n'avais, pourtant, jamais imaginé ou penser apprendre des langages informatiques. Loin de mes études qui étaient les sciences et techniques de laboratoire, ça me semblait même peu accessible autrement que par l'université.",
        "Mais la magie d'internet a opéré et a pu me montrer qu'il était possible de mettre à profit mon autodidaxie et par la suite, d'intégrer une formation en full remote et de me former dans le développement web !"
    ],
    "motivations": [
        "Arrivé à la fin de ma formation de développeur web, je cherche maintenant à étendre mes connaissances et développer plus encore mes compétences.",
        "La pratique étant la meilleur des formatrices, je peux désormais consacré mon temps dans la réalisation de projet et l'apprentissage de nouvelles technologies.",
        "Parmis mes prochains objectifs, Firebase, Typescript et Tailwind sont les sujets de mon travail d'autodidacte à venir.",
        "Je suis ouvert à tout projets ou propositions."
    ],
    "hobbies": [
        "Jeux-vidéo (Playstation, Nintendo)",
        "Enrichissement de Culture générale",
        "Leture et musique (cliché mais pour le coup c'est vrai 😅)",
        "Et tellement plus encore ! 😎"
    ]
}